{
    "projects": [
        {
            "_id": "my-portfolio",
            "title": "My porfolio",
            "subtitle": "FullStack web application where I can talk about my latest projects and a way to let clients reach out to me.",
            "technicalSheet": "I can say that, this app is the biggest and the nicest work I've ever made. I can't remember any day of the thirty days it took me to launched, I wasn't happy working on it. Server-side was implemented using NodeJs to serve a mini API and some images. Front-end was implemented using React and Redux. It seems Redux is overkill for this kind of apps but I choosed because I love the idea of managing the data in one place. The animation between pages is implemented using react-transition-group. For CSS I used SASS. I wrote JEST and Enzyme as usual for testing. Responsiveness was my major concern so I hope I did all right.",
            "images": [
                "image1.jpg",
                "image2.jpg",
                "image3.jpg",
                "image4.jpg",
                "image5.jpg"
            ],
            "technologies": [
                "HTML5",
                "SASS",
                "JavaScript",
                "React",
                "React Router",
                "Redux",
                "Redux thunk",
                "React Transition Group",
                "Jest",
                "Enzyme",
                "Webpack",
                "Babel",
                "NodeJs",
                "ExpressJs"
            ],
            "resources": {
                "online": "https://www.shadialtarsha.com/"
            },
            "tags": [
                "JavaScript",
                "React",
                "Redux",
                "SASS",
                "Full-Stack",
                "NodeJs",
                "Jest",
                "Enzyme"
            ]
        },
        {
            "_id": "overtime",
            "title": "Overtime",
            "subtitle": "Overtime is a social media app designed to facilitate communication and discussions among users and publish matches' schedules.",
            "technicalSheet": "Overtime is an android application which is Football social media app. Users can use this app to find football matches schedules and share their ideas and opinions about anything related to football. Writing posts, comments, and expressing feelings by liking them is what this app is all about, with the ability of creating groups and/or join them or even sending messages to users’ friends. Users with Overtime can talk about sport and enjoy their time with people with the same interests and insights. Overtime is built based on Firebase platform, with minimum sdk version 21, which means that devices with Marshmallow android version and above can install this app. Users should register before using the app. Then, they can write posts about their favorite teams, players or whatever is on their minds, follow other people which is using this app, and share their opinions and comments about what other users write. They will be able to join a group where they can talk about a shared topic that every member loves. Also users can send messages to their friends if they want to use our direct messages feature.",
            "images": [
                "image1.jpg",
                "image2.jpg",
                "image3.jpg",
                "image4.jpg",
                "image5.jpg",
                "image6.jpg"
            ],
            "technologies": [
                "Java",
                "Android",
                "Firebase"
            ],
            "resources": {
                "github": "https://github.com/shadialtarsha/Overtime"
            },
            "tags": [
                "Java",
                "Android",
                "Firebase"
            ]
        },
        {
            "_id": "expensify",
            "title": "Expensify",
            "subtitle": "Front-end web application helps users to manage thier expenses.",
            "technicalSheet": "I made this app to implement all what I've been learning about ReactJs and Redux. I learned tons of things while I was building this project such as implementing client routing, using SASS, and apply middleware to Redux using Redux thunk. As all of my projects I tested my code using Jest and Enzyme which are very great combination for testing React apps.",
            "images": [
                "image1.jpg",
                "image2.jpg",
                "image3.jpg",
                "image4.jpg"
            ],
            "technologies": [
                "HTML5",
                "SASS",
                "JavaScript",
                "React",
                "React Router",
                "Redux",
                "Redux thunk",
                "Firebase",
                "Jest",
                "Enzyme",
                "Webpack",
                "Babel",
                "NodeJs"
            ],
            "resources": {
                "online": "https://shadi-expensify-app.herokuapp.com/",
                "github": "https://github.com/shadialtarsha/expensify-app"
            },
            "tags": [
                "JavaScript",
                "React",
                "Redux",
                "SASS",
                "Firebase",
                "Front-end",
                "Jest",
                "Enzyme"
            ]
        },
        {
            "_id": "indecision",
            "title": "Indecision",
            "subtitle": "Front-end web application helps users to make a decision with the help of computer.",
            "technicalSheet": "The main reason for making this app was to emphasize my knowleadge about testing and structuring projects and implement advanced stuff like React, Redux and client routing.",
            "images": [
                "image1.jpg",
                "image2.jpg",
                "image3.jpg"
            ],
            "technologies": [
                "HTML5",
                "SASS",
                "JavaScript",
                "React",
                "React Router",
                "Redux",
                "Redux thunk",
                "Firebase",
                "Jest",
                "Enzyme",
                "Webpack",
                "Babel",
                "NodeJs"
            ],
            "resources": {
                "online": "https://shadi-indecision-app.herokuapp.com/",
                "github": "https://github.com/shadialtarsha/indecision-app"
            },
            "tags": [
                "JavaScript",
                "React",
                "Redux",
                "SASS",
                "Firebase",
                "Front-end",
                "Jest",
                "Enzyme"
            ]
        },
        {
            "_id": "todo-app",
            "title": "Todo App",
            "subtitle": "Simple FullStack app for recording my todos.",
            "technicalSheet": "This app was my entrance to FullStack apps. Using MongoDB and ExpressJs to create a RESTFUL API for serving the necessary data for the frontend app. I used jQuery's ajax implementaion to call the API.",
            "images": [
                "image1.jpg"
            ],
            "technologies": [
                "HTML5",
                "CSS3",
                "JavaScript",
                "NodeJs",
                "ExpressJs",
                "MongoDB",
                "Mongoose",
                "RESTFUL API",
                "jQuery",
                "AJAX"
            ],
            "resources": {
                "online": "https://github.com/shadialtarsha/todo-app",
                "github": "https://shadi-todo-app.herokuapp.com/"
            },
            "tags": [
                "JavaScript",
                "FullStack",
                "NodeJs",
                "ExpressJs",
                "MongoDB",
                "Mongoose",
                "RESTFUL API",
                "AJAX"
            ]
        },
        {
            "_id": "chat-app-with-socketio",
            "title": "Chat App with Socket.io",
            "subtitle": "Create or join a chat room and exhange messages with other.",
            "technicalSheet": "This app was my first experience of realtime web applications. I used socket.io library to enable realtime, bi-directional communtication between users via NodeJs server.",
            "images": [
                "image1.jpg",
                "image2.jpg"
            ],
            "technologies": [
                "HTML5",
                "CSS3",
                "JavaScript",
                "NodeJs",
                "ExpressJs",
                "Mustach",
                "Mocha",
                "expect"
            ],
            "resources": {
                "online": "https://github.com/shadialtarsha/chat-app-socketio",
                "github": "https://shadi-chat-app.herokuapp.com/"
            },
            "tags": [
                "JavaScript",
                "socket.io",
                "NodeJs",
                "ExpressJs",
                "Mocha"
            ]
        }
    ]
}